; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-5degree-100mindistance-3trucks-5packages-1086seed

(define (problem transport-three-cities-sequential-4nodes-1000size-5degree-100mindistance-3trucks-5packages-1086seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 873,595 -> 937,936
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 35)
  ; 937,936 -> 873,595
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 35)
  ; 684,390 -> 937,936
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 61)
  ; 937,936 -> 684,390
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 61)
  ; 684,390 -> 873,595
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 28)
  ; 873,595 -> 684,390
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 28)
  ; 331,829 -> 937,936
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 62)
  ; 937,936 -> 331,829
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 62)
  ; 331,829 -> 873,595
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 59)
  ; 873,595 -> 331,829
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 59)
  ; 331,829 -> 684,390
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 57)
  ; 684,390 -> 331,829
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 57)
  ; 2962,181 -> 2739,497
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 39)
  ; 2739,497 -> 2962,181
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 39)
  ; 2935,365 -> 2739,497
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 24)
  ; 2739,497 -> 2935,365
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 24)
  ; 2935,365 -> 2962,181
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 19)
  ; 2962,181 -> 2935,365
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 19)
  ; 2581,735 -> 2739,497
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 29)
  ; 2739,497 -> 2581,735
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 29)
  ; 2581,735 -> 2962,181
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 68)
  ; 2962,181 -> 2581,735
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 68)
  ; 2581,735 -> 2935,365
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 52)
  ; 2935,365 -> 2581,735
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 52)
  ; 1913,2892 -> 1911,2203
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 69)
  ; 1911,2203 -> 1913,2892
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 69)
  ; 1310,2486 -> 1911,2203
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 67)
  ; 1911,2203 -> 1310,2486
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 67)
  ; 1310,2486 -> 1913,2892
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 73)
  ; 1913,2892 -> 1310,2486
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 73)
  ; 1574,2743 -> 1911,2203
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 64)
  ; 1911,2203 -> 1574,2743
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 64)
  ; 1574,2743 -> 1913,2892
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 37)
  ; 1913,2892 -> 1574,2743
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 37)
  ; 1574,2743 -> 1310,2486
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 37)
  ; 1310,2486 -> 1574,2743
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 37)
  ; 937,936 <-> 2581,735
  (road city-1-loc-1 city-2-loc-4)
  (= (road-length city-1-loc-1 city-2-loc-4) 166)
  (road city-2-loc-4 city-1-loc-1)
  (= (road-length city-2-loc-4 city-1-loc-1) 166)
  (road city-1-loc-1 city-3-loc-4)
  (= (road-length city-1-loc-1 city-3-loc-4) 166)
  (road city-3-loc-4 city-1-loc-1)
  (= (road-length city-3-loc-4 city-1-loc-1) 166)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 186)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 186)
  (at package-1 city-3-loc-4)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-1)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-4)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-4)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-4)
  (capacity truck-3 capacity-2)
 )
 (:goal (and
  (at package-1 city-3-loc-1)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-3)
  (at package-4 city-1-loc-3)
  (at package-5 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-4)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 5
2. (pick-up truck-3 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-3 capacity-2)
   added: (in package-2 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 5
3. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 5
4. (pick-up truck-3 city-1-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-1) (capacity truck-3 capacity-1)
   added: (in package-3 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 5
5. (drive truck-3 city-1-loc-1 city-2-loc-4)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-2-loc-4)
   goals met: 0 of 5
6. (drive truck-3 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-2-loc-3)
   goals met: 0 of 5
7. (drop truck-3 city-2-loc-3 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-0)
   added: (at package-3 city-2-loc-3) (capacity truck-3 capacity-1)
   goals met: 1 of 5
8. (drive truck-3 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 5
9. (pick-up truck-3 city-2-loc-2 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-2-loc-2) (capacity truck-3 capacity-1)
   added: (in package-4 truck-3) (capacity truck-3 capacity-0)
   goals met: 1 of 5
10. (drop truck-3 city-2-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-0)
   added: (at package-2 city-2-loc-2) (capacity truck-3 capacity-1)
   goals met: 2 of 5
11. (drive truck-3 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-4)
   goals met: 2 of 5
12. (pick-up truck-3 city-2-loc-4 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-2-loc-4) (capacity truck-3 capacity-1)
   added: (in package-5 truck-3) (capacity truck-3 capacity-0)
   goals met: 2 of 5
13. (pick-up truck-2 city-3-loc-4 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-3-loc-4) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 5
14. (drive truck-2 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-4)
   added: (at truck-2 city-3-loc-1)
   goals met: 2 of 5
15. (drive truck-3 city-2-loc-4 city-1-loc-1)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-1-loc-1)
   goals met: 2 of 5
16. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 2 of 5
17. (drop truck-2 city-3-loc-1 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-3-loc-1) (capacity truck-2 capacity-2)
   goals met: 3 of 5
18. (drop truck-3 city-1-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-0)
   added: (at package-4 city-1-loc-3) (capacity truck-3 capacity-1)
   goals met: 4 of 5
19. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 4 of 5
20. (drive truck-3 city-1-loc-1 city-3-loc-4)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-3-loc-4)
   goals met: 4 of 5
21. (drive truck-3 city-3-loc-4 city-3-loc-3)
   deleted: (at truck-3 city-3-loc-4)
   added: (at truck-3 city-3-loc-3)
   goals met: 4 of 5
22. (drop truck-3 city-3-loc-3 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-3) (capacity truck-3 capacity-1)
   added: (at package-5 city-3-loc-3) (capacity truck-3 capacity-2)
   goals met: 5 of 5
